"""
Ваше завдання - написати функцію, яка отримує дату у вигляді трьох чисел: день, місяць та рік та має на вході розподілювач за замовчанням - "." функція повертає рядок у вигляді "день.місяць.рік". Наприклад, для дати 15 березня 2023 року функція
повинна повертати рядок "15.03.2023". Якщо користувач задає сепаратор відмінний від звичайного, наприклад '/',
то функція повертає "15/03/2023"
Підказка: допоможе використання методу .join():
"""

def data(day, month, year, sep='.'):
    day_str = str(day).zfill(2)
    month_str = str(month).zfill(2)
    year_str = str(year)
    return sep.join([day_str, month_str, year_str])


print(data(8, 9, 2002))
print(data(5, 6, 2000, '/'))

"""
Ваше завдання - написати функцію, яка порівнює два словника, представляючи оцінки студентів за курси. 
Кожен словник має структуру {'ПІБ студента': оцінка}. 
Функція повинна порівнювати оцінки студентів за кожний предмет та повертати словник з 
різницею в оцінках для кожного студента.

```
def compare_grades(grades1, grades2):
    # Ваш код тут
    pass
```

# Приклад використання функції:
grades_1 = {'Анна Коваленко': 90, 'Олег Петров': 85, 'Ірина Сидорова': 78}
grades_2 = {'Анна Коваленко': 92, 'Олег Петров': 87, 'Ірина Сидорова': 80}

result = compare_grades(grades_1, grades_2)
print(result)
# Можливий вивід: {'Анна Коваленко': -2, 'Олег Петров': -2, 'Ірина Сидорова': -2}

Вимоги:
    Функція повинна приймати два аргументи — словники з оцінками студентів (grades1 та grades2).
    Функція повинна порівнювати оцінки за кожним ключем (ПІБ студента) та повертати словник, 
    в якому ключами є ПІБ студентів, а значеннями — різниця в оцінках між grades1 та grades2.
    Виведіть результат для прикладу використання функції.
    Перевірте функцію на кількох тестових вхідних даних, включаючи випадки,
    коли студенти отримали різні оцінки або коли є студенти, 
    які взагалі не мають оцінок в одному зі словників.

"""


def compare_grades(grades1, grades2):
    difference = {}
    all_students = set(grades1.keys()).union(set(grades2.keys()))

    for student in all_students:
        grade1 = grades1.get(student, 0)
        grade2 = grades2.get(student, 0)
        difference[student] = grade1 - grade2
    return difference


grades_1 = {'Анна Коваленко': 90, 'Олег Петров': 85, 'Ірина Сидорова': 78}
grades_2 = {'Анна Коваленко': 92, 'Олег Петров': 87, 'Ірина Сидорова': 80}

result = compare_grades(grades_1, grades_2)
print(result)


